Project/Toir/src/Reports/торо_ФактическиеЗатратыПоОбъектамРемонта/торо_ФактическиеЗатратыПоОбъектамРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ФактическиеЗатратыПоОбъектамРемонта</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ЗатратыПоИсполнителямВыполненныхРемонтов/торо_ЗатратыПоИсполнителямВыполненныхРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ЗатратыПоИсполнителямВыполненныхРемонтов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/AccumulationRegisters/торо_ФактическиеТрудовыеЗатратыРемонтныхРабот/торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ФактическиеТрудовыеЗатратыРемонтныхРабот</name>
  <comment>Фактические трудовые затраты ремонтных работ</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/AccumulationRegisters/торо_ФактическиеМатериальныеЗатратыРемонтныхРабот/торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ФактическиеМатериальныеЗатратыРемонтныхРабот</name>
  <comment>Фактические материальные затраты ремонтных работ</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/AccumulationRegisters/торо_ФактическиеЗатратыЗапчастей/торо_ФактическиеЗатратыЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ФактическиеЗатратыЗапчастей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ОперацииВнешнихОснованийДляРабот</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Reports/торо_ФактическиеЗатратыПоОбъектамРемонта/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъединенныеДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ОбъединенныеДанные.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ОбъединенныеДанные.Номенклатура КАК Номенклатура,
		|	ОбъединенныеДанные.Количество КАК Количество,
		|	ОбъединенныеДанные.РемонтнаяГруппа КАК РемонтнаяГруппа,
		|	ОбъединенныеДанные.ДатаОкончанияРабот КАК ДатаОкончанияРабот,
		|	ОбъединенныеДанные.ДатаНачалаРабот КАК ДатаНачалаРабот,
		|	ОбъединенныеДанные.ВидЗатрат КАК ВидЗатрат,
		|	ОбъединенныеДанные.Сумма КАК Сумма,
		|	ОбъединенныеДанные.Сортировка КАК Сортировка,
		|	ОбъединенныеДанные.Подразделение КАК Подразделение,
		|	ОбъединенныеДанные.Квалификация КАК Квалификация,
		|	ОбъединенныеДанные.Месяц КАК Месяц,
		|	ОбъединенныеДанные.Цена КАК Цена,
		|	ОбъединенныеДанные.АктОВыполненииЭтапаРабот КАК АктОВыполненииЭтапаРабот,
		|	ОбъединенныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ОбъединенныеДанные КАК ОбъединенныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ОбъединенныеДанные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		|		ПО ОбъединенныеДанные.АктОВыполненииЭтапаРабот = торо_АктОВыполненииЭтапаРабот.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединенныеДанные.ОбъектРемонта,
		|	ОбъединенныеДанные.РемонтнаяРабота,
		|	ОбъединенныеДанные.Номенклатура,
		|	ОбъединенныеДанные.Количество,
		|	ОбъединенныеДанные.РемонтнаяГруппа,
		|	ОбъединенныеДанные.ДатаОкончанияРабот,
		|	ОбъединенныеДанные.ДатаНачалаРабот,
		|	ОбъединенныеДанные.ВидЗатрат,
		|	ОбъединенныеДанные.Сумма,
		|	ОбъединенныеДанные.Сортировка,
		|	ОбъединенныеДанные.Подразделение,
		|	ОбъединенныеДанные.Квалификация,
		|	ОбъединенныеДанные.Месяц,
		|	ОбъединенныеДанные.Цена,
		|	ОбъединенныеДанные.АктОВыполненииЭтапаРабот,
		|	ОбъединенныеДанные.ХарактеристикаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник." + ТекИерархия.ТипРеквизитаОР + ".ПустаяСсылка)
		|ИЗ
		|	ОбъединенныеДанные КАК ОбъединенныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия КАК торо_АктОВыполненииРегламентногоМероприятия
		|		ПО ОбъединенныеДанные.АктОВыполненииЭтапаРабот = торо_АктОВыполненииРегламентногоМероприятия.Ссылка
		|ГДЕ
		|	НЕ ОбъединенныеДанные.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъединенныеДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ОбъединенныеДанные.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ОбъединенныеДанные.Номенклатура КАК Номенклатура,
		|	ОбъединенныеДанные.Количество КАК Количество,
		|	ОбъединенныеДанные.РемонтнаяГруппа КАК РемонтнаяГруппа,
		|	ОбъединенныеДанные.ДатаОкончанияРабот КАК ДатаОкончанияРабот,
		|	ОбъединенныеДанные.ДатаНачалаРабот КАК ДатаНачалаРабот,
		|	ОбъединенныеДанные.ВидЗатрат КАК ВидЗатрат,
		|	ОбъединенныеДанные.Сумма КАК Сумма,
		|	ОбъединенныеДанные.Сортировка КАК Сортировка,
		|	ОбъединенныеДанные.Подразделение КАК Подразделение,
		|	ОбъединенныеДанные.Квалификация КАК Квалификация,
		|	ОбъединенныеДанные.Месяц КАК Месяц,
		|	ОбъединенныеДанные.Цена КАК Цена,
		|	ОбъединенныеДанные.АктОВыполненииЭтапаРабот КАК АктОВыполненииЭтапаРабот,
		|	ОбъединенныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОбъединенныеДанные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ОбъединенныеДанные КАК ОбъединенныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ОбъединенныеДанные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		|		ПО ОбъединенныеДанные.АктОВыполненииЭтапаРабот = торо_АктОВыполненииЭтапаРабот.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединенныеДанные.ОбъектРемонта,
		|	ОбъединенныеДанные.РемонтнаяРабота,
		|	ОбъединенныеДанные.Номенклатура,
		|	ОбъединенныеДанные.Количество,
		|	ОбъединенныеДанные.РемонтнаяГруппа,
		|	ОбъединенныеДанные.ДатаОкончанияРабот,
		|	ОбъединенныеДанные.ДатаНачалаРабот,
		|	ОбъединенныеДанные.ВидЗатрат,
		|	ОбъединенныеДанные.Сумма,
		|	ОбъединенныеДанные.Сортировка,
		|	ОбъединенныеДанные.Подразделение,
		|	ОбъединенныеДанные.Квалификация,
		|	ОбъединенныеДанные.Месяц,
		|	ОбъединенныеДанные.Цена,
		|	ОбъединенныеДанные.АктОВыполненииЭтапаРабот,
		|	ОбъединенныеДанные.ХарактеристикаНоменклатуры,		
		|	ОбъединенныеДанные.ОбъектРемонта
		|ИЗ
		|	ОбъединенныеДанные КАК ОбъединенныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия КАК торо_АктОВыполненииРегламентногоМероприятия
		|		ПО ОбъединенныеДанные.АктОВыполненииЭтапаРабот = торо_АктОВыполненииРегламентногоМероприятия.Ссылка
		|ГДЕ
		|	НЕ ОбъединенныеДанные.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ДобавитьПараметрыВСКД();
	дс_ЗаполнитьРесурсы();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере 						= Истина;
	Настройки.События.ПриСозданииНаСервере 								= Истина;
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиКомпоновщика, Форма);
		
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиКомпоновщика, Форма);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы, НастройкиКомпоновщика, Форма)
	
	// Сделать привязку между выводимыми данными в отчете и ФО в системе:
	// 1. Флаг "По дефектам" - ФО "Учет выявленных дефектов";
	// 2. Флаг "По ППР" - ФО "Использовать ППР";
	// 3. Флаг "По предписаниям" - ФО "Использовать внешние основания для работ";
	// 4. Флаг "По регламентным мероприятиям" - ФО "Использовать регламентные мероприятия";
	// 5. Флаг "Затраты по запчастям" - ФО "Учет запчастей".

	ФО_УчетДефектов = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
	ФО_ИспользоватьППР = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФО_ИспользоватьВнешниеОснования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот");
	ФО_ИспользоватьРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
	ФО_УчетЗапчастей = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(Элемент.Параметр) = "ПоДефектам" И Не ФО_УчетДефектов Тогда
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ИначеЕсли Строка(Элемент.Параметр) = "ПоППР" И Не ФО_ИспользоватьППР Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ИначеЕсли Строка(Элемент.Параметр) = "ПоПредписаниям" И Не ФО_ИспользоватьВнешниеОснования Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ИначеЕсли Строка(Элемент.Параметр) = "ПоРегламентнымМероприятиям" И Не ФО_ИспользоватьРегламентныеМероприятия Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ИначеЕсли Строка(Элемент.Параметр) = "ЗатратыПоЗапчастям" И Не ФО_УчетЗапчастей Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	ФО_УчетДефектов = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
	ФО_ИспользоватьППР = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФО_ИспользоватьВнешниеОснования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот");
	ФО_ИспользоватьРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
	ФО_УчетЗапчастей = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");

	Если ЭтоАдресВременногоХранилища(Форма.НастройкиОтчета.АдресСхемы) Тогда
		СКД = ПолучитьИзВременногоХранилища(Форма.НастройкиОтчета.АдресСхемы);
		
		Параметр = СКД.Параметры.Найти("ПоДефектам");
		Если Параметр <> Неопределено И Не ФО_УчетДефектов Тогда
			Параметр.Значение = Ложь;
			Параметр.ОграничениеИспользования = Истина;
		КонецЕсли;
		
		Параметр = СКД.Параметры.Найти("ПоППР");
		Если Параметр <> Неопределено И Не ФО_ИспользоватьППР Тогда
			Параметр.Значение = Ложь;
			Параметр.ОграничениеИспользования = Истина;
		КонецЕсли;

		Параметр = СКД.Параметры.Найти("ПоПредписаниям");
		Если Параметр <> Неопределено И Не ФО_ИспользоватьВнешниеОснования Тогда
			Параметр.Значение = Ложь;
			Параметр.ОграничениеИспользования = Истина;
		КонецЕсли;

		Параметр = СКД.Параметры.Найти("ПоРегламентнымМероприятиям");
		Если Параметр <> Неопределено И Не ФО_ИспользоватьРегламентныеМероприятия Тогда
			Параметр.Значение = Ложь;
			Параметр.ОграничениеИспользования = Истина;
		КонецЕсли;
		
		Параметр = СКД.Параметры.Найти("ЗатратыПоЗапчастям");
		Если Параметр <> Неопределено И Не ФО_УчетЗапчастей Тогда
			Параметр.Значение = Ложь;
			Параметр.ОграничениеИспользования = Истина;
		КонецЕсли;

		Форма.НастройкиОтчета.АдресСхемы = ПоместитьВоВременноеХранилище(СКД, Форма.НастройкиОтчета.АдресСхемы);
		Форма.НастройкиОтчета.СхемаМодифицирована = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_Ремонты.ID КАК ID
	|ПОМЕСТИТЬ РемонтыПоВыбраннымДокументам
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	(&внПоППР = ИСТИНА
	|				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	|			ИЛИ &внПоПредписаниям = ИСТИНА
	|				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|			ИЛИ &внПоДефектам = ИСТИНА
	|				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
	|			ИЛИ &внПоРегламентным
	|				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыСрезПоследних.ОбъектРемонта.ТиповойОР КАК РемонтнаяГруппа,
	|	торо_РемонтыСрезПоследних.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	торо_РемонтыСрезПоследних.ID КАК ID,
	|	торо_РемонтыСрезПоследних.ОбъектРемонта.ТиповойОР КАК ТиповойОР,
	|	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Ремонты
	|ИЗ
	|	РегистрСведений.торо_Ремонты.СрезПоследних(
	|			{(&ТекущаяДата)},
	|			ID В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					РемонтыПоВыбраннымДокументам.ID
	|				ИЗ
	|					РемонтыПоВыбраннымДокументам КАК РемонтыПоВыбраннымДокументам)) КАК торо_РемонтыСрезПоследних
	|ГДЕ
	|	(НЕ торо_РемонтыСрезПоследних.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ НЕ торо_РемонтыСрезПоследних.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|{ГДЕ
	|	(торо_РемонтыСрезПоследних.ДатаНачалаФакт МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты.Исполнитель КАК Исполнитель,
	|	торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты.ТехнологическаяОперация КАК ТехнологическаяОперация,
	|	торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты.СуммаОборот КАК СуммаОборот,
	|	торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|ПОМЕСТИТЬ ВТ_ЗатратыПоИсполнителям
	|ИЗ
	|	РегистрНакопления.торо_ЗатратыПоИсполнителямВыполненныхРемонтов.Обороты(
	|			,
	|			,
	|			,
	|			&внВыполняемыеПодрядчиками = ИСТИНА
	|				И РемонтыОборудования_ID В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Ремонты.ID
	|					ИЗ
	|						ВТ_Ремонты КАК ВТ_Ремонты)
	|				И ТИПЗНАЧЕНИЯ(Исполнитель) = ТИП(Справочник.Контрагенты)) КАК торо_ЗатратыПоИсполнителямВыполненныхРемонтовОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.ID КАК ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Квалификация КАК Квалификация,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Сотрудник КАК Сотрудник,
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Количество) КАК КоличествоОборот,
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Сумма) КАК СуммаОборот,
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.ВремяРаботы) КАК ВремяРаботы
	|ПОМЕСТИТЬ ВТ_ФактическиеТрудовыеЗатраты
	|ИЗ
	|	РегистрНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот КАК торо_ФактическиеТрудовыеЗатратыРемонтныхРабот
	|ГДЕ
	|	&внТрудозатраты = ИСТИНА
	|	И торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_Ремонты.ID
	|			ИЗ
	|				ВТ_Ремонты КАК ВТ_Ремонты)
	|{ГДЕ
	|	(торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Период МЕЖДУ &НачалоПериода И &КонецПериода)}
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтнаяРабота,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Квалификация,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ФактическиеТрудовыеЗатраты.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ФактическиеТрудовыеЗатраты.Сотрудник КАК Исполнитель,
	|	0 КАК Количество,
	|	""Трудозатраты"" КАК ВидЗатрат,
	|	ВТ_ФактическиеТрудовыеЗатраты.СуммаОборот КАК СуммаОборот,
	|	ВТ_ФактическиеТрудовыеЗатраты.ID КАК УникальныйИдентификатор,
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Ремонты.РемонтнаяГруппа КАК РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВТ_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	ВТ_ФактическиеТрудовыеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ФактическиеТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ВТ_ФактическиеТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
	|	ВТ_Ремонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Трудозатраты
	|ИЗ
	|	ВТ_ФактическиеТрудовыеЗатраты КАК ВТ_ФактическиеТрудовыеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО ВТ_ФактическиеТрудовыеЗатраты.РемонтыОборудования_ID = ВТ_Ремонты.ID
	|ГДЕ
	|	&внТрудозатраты = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗатратыПоИсполнителям.ТехнологическаяОперация КАК РемонтнаяРабота,
	|	ВТ_ЗатратыПоИсполнителям.Исполнитель КАК Исполнитель,
	|	0 КАК Количество,
	|	""Трудозатраты"" КАК ВидЗатрат,
	|	ВТ_ЗатратыПоИсполнителям.СуммаОборот КАК СуммаОборот,
	|	ВТ_ЗатратыПоИсполнителям.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Ремонты.РемонтнаяГруппа КАК РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВТ_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	ВТ_ЗатратыПоИсполнителям.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ЗНАЧЕНИЕ(Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка) КАК Квалификация,
	|	0 КАК ВремяРаботы,
	|	ВТ_Ремонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТабТрудозатратПодрядчиков
	|ИЗ
	|	ВТ_ЗатратыПоИсполнителям КАК ВТ_ЗатратыПоИсполнителям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО ВТ_ЗатратыПоИсполнителям.РемонтыОборудования_ID = ВТ_Ремонты.ID
	|ГДЕ
	|	&внВыполняемыеПодрядчиками = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ФОХарактеристика
	|			ТОГДА торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	СУММА(торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Количество) КАК Количество,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот
	|ИЗ
	|	РегистрНакопления.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот КАК торо_ФактическиеМатериальныеЗатратыРемонтныхРабот
	|ГДЕ
	|	&внМатериальныеЗатраты = ИСТИНА
	|	И торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_Ремонты.ID
	|			ИЗ
	|				ВТ_Ремонты КАК ВТ_Ремонты)
	|{ГДЕ
	|	(торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Период МЕЖДУ &НачалоПериода И &КонецПериода)}
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтнаяРабота,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Период,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ФОХарактеристика
	|			ТОГДА торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.Количество) КАК Количество,
	|	ВТ_Ремонты.РемонтнаяГруппа КАК РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияРабот,
	|	ВТ_Ремонты.ДатаНачалаФакт КАК ДатаНачалаРабот,
	|	""Материальные затраты"" КАК ВидЗатрат,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.Период КАК Период,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК ТипЦены,
	|	ВТ_Ремонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ФактическиеЗатратыНоменклатуры
	|ИЗ
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот КАК ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID = ВТ_Ремонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Ремонты.ОбъектРемонта,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтнаяРабота,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	ВТ_Ремонты.РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаОкончанияФакт,
	|	ВТ_Ремонты.ДатаНачалаФакт,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.Период,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ВТ_ФактическиеМатериальныеЗатратыРемонтныхРабот.ЕдиницаИзмерения,
	|	ВТ_Ремонты.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ФактическиеЗатратыЗапчастейОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ФОХарактеристика
	|			ТОГДА торо_ФактическиеЗатратыЗапчастейОбороты.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	СУММА(торо_ФактическиеЗатратыЗапчастейОбороты.КоличествоОборот) КАК Количество,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ФактическиеЗатратыЗапчастей
	|ИЗ
	|	РегистрНакопления.торо_ФактическиеЗатратыЗапчастей.Обороты(
	|			,
	|			,
	|			Секунда,
	|			&внЗатратыЗапчастей = ИСТИНА
	|				И РемонтыОборудования_ID В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Ремонты.ID
	|					ИЗ
	|						ВТ_Ремонты КАК ВТ_Ремонты)) КАК торо_ФактическиеЗатратыЗапчастейОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Период,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Номенклатура,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.РемонтыОборудования_ID,
	|	торо_ФактическиеЗатратыЗапчастейОбороты.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ФОХарактеристика
	|			ТОГДА торо_ФактическиеЗатратыЗапчастейОбороты.ХарактеристикаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ФактическиеЗатратыЗапчастей.Номенклатура КАК Номенклатура,
	|	ВТ_ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	""Запчасти"" КАК ВидЗатрат,
	|	СУММА(ВТ_ФактическиеЗатратыЗапчастей.Количество) КАК Количество,
	|	ВТ_Ремонты.РемонтнаяГруппа КАК РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияРабот,
	|	ВТ_Ремонты.ДатаНачалаФакт КАК ДатаНачалаРабот,
	|	""Установка запчастей"" КАК РемонтнаяРабота,
	|	ВТ_ФактическиеЗатратыЗапчастей.Период КАК Период,
	|	ВТ_ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК ТипЦены,
	|	ВТ_Ремонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ФактическиеЗатратыЗапчастей
	|ИЗ
	|	ВТ_ФактическиеЗатратыЗапчастей КАК ВТ_ФактическиеЗатратыЗапчастей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО ВТ_ФактическиеЗатратыЗапчастей.РемонтыОборудования_ID = ВТ_Ремонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Ремонты.ОбъектРемонта,
	|	ВТ_ФактическиеЗатратыЗапчастей.Номенклатура,
	|	ВТ_ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	ВТ_Ремонты.РемонтнаяГруппа,
	|	ВТ_Ремонты.ДатаОкончанияФакт,
	|	ВТ_Ремонты.ДатаНачалаФакт,
	|	ВТ_ФактическиеЗатратыЗапчастей.Период,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ВТ_ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения,
	|	ВТ_Ремонты.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЗатратыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ФактическиеЗатратыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ФактическиеЗатратыНоменклатуры.Период КАК ФактическийПериод,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ФактическийПериодРегистр,
	|	ФактическиеЗатратыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЗатратыНоменклатуры.ТипЦены КАК ТипЦены
	|ПОМЕСТИТЬ ПериодыРегистрацииЦен
	|ИЗ
	|	ФактическиеЗатратыНоменклатуры КАК ФактическиеЗатратыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ФактическиеЗатратыНоменклатуры.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ФактическиеЗатратыНоменклатуры.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|			И ФактическиеЗатратыНоменклатуры.Период >= ЦеныНоменклатуры.Период
	|			И ФактическиеЗатратыНоменклатуры.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ФактическиеЗатратыНоменклатуры.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеЗатратыНоменклатуры.Номенклатура,
	|	ФактическиеЗатратыНоменклатуры.ХарактеристикаНоменклатуры,
	|	ФактическиеЗатратыНоменклатуры.Период,
	|	ФактическиеЗатратыНоменклатуры.ЕдиницаИзмерения,
	|	ФактическиеЗатратыНоменклатуры.ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЗатратыЗапчастей.Номенклатура КАК Номенклатура,
	|	ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ФактическиеЗатратыЗапчастей.Период КАК ФактическийПериод,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ФактическийПериодРегистр,
	|	ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЗатратыЗапчастей.ТипЦены КАК ТипЦены
	|ПОМЕСТИТЬ ПериодыРегистрацииЦенЗапчастей
	|ИЗ
	|	ФактическиеЗатратыЗапчастей КАК ФактическиеЗатратыЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ФактическиеЗатратыЗапчастей.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|			И ФактическиеЗатратыЗапчастей.Период >= ЦеныНоменклатуры.Период
	|			И ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ФактическиеЗатратыЗапчастей.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеЗатратыЗапчастей.Номенклатура,
	|	ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	ФактическиеЗатратыЗапчастей.Период,
	|	ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения,
	|	ФактическиеЗатратыЗапчастей.ТипЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыРегистрацииЦен.Номенклатура КАК Номенклатура,
	|	ПериодыРегистрацииЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПериодыРегистрацииЦен.ФактическийПериод КАК ФактическийПериод,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ПериодыРегистрацииЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПериодыРегистрацииЦен.ТипЦены КАК ТипЦены,
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ ФактическиеЦеныНаНоменклатуруВалюта
	|ИЗ
	|	ПериодыРегистрацииЦен КАК ПериодыРегистрацииЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ПериодыРегистрацииЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ПериодыРегистрацииЦен.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|			И ПериодыРегистрацииЦен.ФактическийПериодРегистр = ЦеныНоменклатуры.Период
	|			И ПериодыРегистрацииЦен.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ПериодыРегистрацииЦен.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЦеныНаНоменклатуруВалюта.Номенклатура КАК Номенклатура,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Цена КАК Цена,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ТипЦены КАК ТипЦены,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ФактическийПериод КАК ФактическийПериод,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Валюта КАК Валюта,
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период
	|ПОМЕСТИТЬ ФактическиеЦеныНаНоменклатуруПериодыКурсов
	|ИЗ
	|	ФактическиеЦеныНаНоменклатуруВалюта КАК ФактическиеЦеныНаНоменклатуруВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ФактическиеЦеныНаНоменклатуруВалюта.ФактическийПериод >= КурсыВалют.Период
	|			И ФактическиеЦеныНаНоменклатуруВалюта.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеЦеныНаНоменклатуруВалюта.Номенклатура,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ХарактеристикаНоменклатуры,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Цена,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ЕдиницаИзмерения,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ТипЦены,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ФактическийПериод,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЦеныНаНоменклатуруВалюта.Номенклатура КАК Номенклатура,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Цена КАК Цена,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ТипЦены КАК ТипЦены,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ФактическийПериод КАК ФактическийПериод,
	|	ФактическиеЦеныНаНоменклатуруВалюта.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность,
	|	ФактическиеЦеныНаНоменклатуруВалюта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ФактическиеЦеныНаНоменклатуру
	|ИЗ
	|	ФактическиеЦеныНаНоменклатуруПериодыКурсов КАК ФактическиеЦеныНаНоменклатуруВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ФактическиеЦеныНаНоменклатуруВалюта.Период = КурсыВалют.Период
	|			И ФактическиеЦеныНаНоменклатуруВалюта.Валюта = КурсыВалют.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыРегистрацииЦенЗапчастей.Номенклатура КАК Номенклатура,
	|	ПериодыРегистрацииЦенЗапчастей.ФактическийПериод КАК ФактическийПериод,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ПериодыРегистрацииЦенЗапчастей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПериодыРегистрацииЦенЗапчастей.ТипЦены КАК ТипЦены,
	|	ЦеныНоменклатуры.Валюта КАК Валюта,
	|	ПериодыРегистрацииЦенЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ФактическиеЦеныЗапчастейВалюта
	|ИЗ
	|	ПериодыРегистрацииЦенЗапчастей КАК ПериодыРегистрацииЦенЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ПериодыРегистрацииЦенЗапчастей.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ПериодыРегистрацииЦенЗапчастей.ФактическийПериодРегистр = ЦеныНоменклатуры.Период
	|			И ПериодыРегистрацииЦенЗапчастей.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ПериодыРегистрацииЦенЗапчастей.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|			И ПериодыРегистрацииЦенЗапчастей.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЦеныЗапчастейВалюта.Номенклатура КАК Номенклатура,
	|	ФактическиеЦеныЗапчастейВалюта.Цена КАК Цена,
	|	ФактическиеЦеныЗапчастейВалюта.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЦеныЗапчастейВалюта.ТипЦены КАК ТипЦены,
	|	ФактическиеЦеныЗапчастейВалюта.ФактическийПериод КАК ФактическийПериод,
	|	ФактическиеЦеныЗапчастейВалюта.Валюта КАК Валюта,
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	|	ФактическиеЦеныЗапчастейВалюта.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ФактическиеЦеныЗапчастейПериодыКурсов
	|ИЗ
	|	ФактическиеЦеныЗапчастейВалюта КАК ФактическиеЦеныЗапчастейВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ФактическиеЦеныЗапчастейВалюта.ФактическийПериод >= КурсыВалют.Период
	|			И ФактическиеЦеныЗапчастейВалюта.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеЦеныЗапчастейВалюта.Номенклатура,
	|	ФактическиеЦеныЗапчастейВалюта.Цена,
	|	ФактическиеЦеныЗапчастейВалюта.ЕдиницаИзмерения,
	|	ФактическиеЦеныЗапчастейВалюта.ТипЦены,
	|	ФактическиеЦеныЗапчастейВалюта.ФактическийПериод,
	|	ФактическиеЦеныЗапчастейВалюта.Валюта,
	|	ФактическиеЦеныЗапчастейВалюта.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЦеныЗапчастейПериодыКурсов.Номенклатура КАК Номенклатура,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.Цена КАК Цена,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.ТипЦены КАК ТипЦены,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.ФактическийПериод КАК ФактическийПериод,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность,
	|	ФактическиеЦеныЗапчастейПериодыКурсов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ФактическиеЦеныЗапчастей
	|ИЗ
	|	ФактическиеЦеныЗапчастейПериодыКурсов КАК ФактическиеЦеныЗапчастейПериодыКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ФактическиеЦеныЗапчастейПериодыКурсов.Период = КурсыВалют.Период
	|			И ФактическиеЦеныЗапчастейПериодыКурсов.Валюта = КурсыВалют.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеЗатратыНоменклатуры.ОбъектРемонта КАК ОбъектРемонта,
	|	ФактическиеЗатратыНоменклатуры.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ФактическиеЗатратыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ФактическиеЗатратыНоменклатуры.Количество КАК Количество,
	|	ЕСТЬNULL(ФактическиеЗатратыНоменклатуры.РемонтнаяГруппа, ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)) КАК РемонтнаяГруппа,
	|	ФактическиеЗатратыНоменклатуры.ДатаОкончанияРабот КАК ДатаОкончанияРабот,
	|	ФактическиеЗатратыНоменклатуры.ДатаНачалаРабот КАК ДатаНачалаРабот,
	|	ФактическиеЗатратыНоменклатуры.ВидЗатрат КАК ВидЗатрат,
	|	ФактическиеЦеныНаНоменклатуру.Цена * ФактическиеЦеныНаНоменклатуру.Курс / ФактическиеЦеныНаНоменклатуру.Кратность * ФактическиеЗатратыНоменклатуры.Количество КАК Сумма,
	|	1 КАК Сортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФактическиеЗатратыНоменклатуры.ОбъектРемонта.ВнешнийОбъект, ЛОЖЬ)
	|			ТОГДА ФактическиеЗатратыНоменклатуры.ОбъектРемонта.Контрагент
	|		ИНАЧЕ ЕСТЬNULL(ФактическиеЗатратыНоменклатуры.ОбъектРемонта.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ КАК Подразделение,
	|	NULL КАК Квалификация,
	|	НАЧАЛОПЕРИОДА(ФактическиеЗатратыНоменклатуры.ДатаОкончанияРабот, МЕСЯЦ) КАК Месяц,
	|	ФактическиеЦеныНаНоменклатуру.Цена КАК Цена,
	|	ФактическиеЗатратыНоменклатуры.Регистратор КАК АктОВыполненииЭтапаРабот,
	|	ФактическиеЗатратыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ОбъединенныеДанные
	|ИЗ
	|	ФактическиеЗатратыНоменклатуры КАК ФактическиеЗатратыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиеЦеныНаНоменклатуру КАК ФактическиеЦеныНаНоменклатуру
	|		ПО ФактическиеЗатратыНоменклатуры.Номенклатура = ФактическиеЦеныНаНоменклатуру.Номенклатура
	|			И ФактическиеЗатратыНоменклатуры.Период = ФактическиеЦеныНаНоменклатуру.ФактическийПериод
	|			И ФактическиеЗатратыНоменклатуры.ЕдиницаИзмерения = ФактическиеЦеныНаНоменклатуру.ЕдиницаИзмерения
	|			И ФактическиеЗатратыНоменклатуры.ТипЦены = ФактическиеЦеныНаНоменклатуру.ТипЦены
	|			И ФактическиеЗатратыНоменклатуры.ХарактеристикаНоменклатуры = ФактическиеЦеныНаНоменклатуру.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТрудоЗатраты.ОбъектРемонта,
	|	ВТ_ТрудоЗатраты.РемонтнаяРабота,
	|	ВТ_ТрудоЗатраты.Исполнитель,
	|	ВТ_ТрудоЗатраты.ВремяРаботы,
	|	ВТ_ТрудоЗатраты.РемонтнаяГруппа,
	|	ВТ_ТрудоЗатраты.ДатаОкончанияФакт,
	|	ВТ_ТрудоЗатраты.ДатаНачалаФакт,
	|	ВТ_ТрудоЗатраты.ВидЗатрат,
	|	ВТ_ТрудоЗатраты.СуммаОборот,
	|	1,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТрудоЗатраты.ОбъектРемонта.ВнешнийОбъект, ЛОЖЬ)
	|			ТОГДА ВТ_ТрудоЗатраты.ОбъектРемонта.Контрагент
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ТрудоЗатраты.ОбъектРемонта.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	ВТ_ТрудоЗатраты.Квалификация,
	|	НАЧАЛОПЕРИОДА(ВТ_ТрудоЗатраты.ДатаОкончанияФакт, МЕСЯЦ),
	|	NULL,
	|	ВТ_ТрудоЗатраты.Регистратор,
	|	NULL
	|ИЗ
	|	ВТ_Трудозатраты КАК ВТ_ТрудоЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабТрудозатратПодрядчиков.ОбъектРемонта,
	|	ТабТрудозатратПодрядчиков.РемонтнаяРабота,
	|	ТабТрудозатратПодрядчиков.Исполнитель,
	|	ТабТрудозатратПодрядчиков.Количество,
	|	ТабТрудозатратПодрядчиков.РемонтнаяГруппа,
	|	ТабТрудозатратПодрядчиков.ДатаОкончанияФакт,
	|	ТабТрудозатратПодрядчиков.ДатаНачалаФакт,
	|	""Ремонт, выполняемый подрядчиками"",
	|	ТабТрудозатратПодрядчиков.СуммаОборот,
	|	2,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТабТрудозатратПодрядчиков.ОбъектРемонта.ВнешнийОбъект, ЛОЖЬ)
	|			ТОГДА ТабТрудозатратПодрядчиков.ОбъектРемонта.Контрагент
	|		ИНАЧЕ ЕСТЬNULL(ТабТрудозатратПодрядчиков.ОбъектРемонта.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	NULL,
	|	НАЧАЛОПЕРИОДА(ТабТрудозатратПодрядчиков.ДатаОкончанияФакт, МЕСЯЦ),
	|	NULL,
	|	ТабТрудозатратПодрядчиков.Регистратор,
	|	NULL
	|ИЗ
	|	ТабТрудозатратПодрядчиков КАК ТабТрудозатратПодрядчиков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФактическиеЗатратыЗапчастей.ОбъектРемонта,
	|	ФактическиеЗатратыЗапчастей.РемонтнаяРабота,
	|	ФактическиеЗатратыЗапчастей.Номенклатура,
	|	ФактическиеЗатратыЗапчастей.Количество,
	|	ФактическиеЗатратыЗапчастей.РемонтнаяГруппа,
	|	ФактическиеЗатратыЗапчастей.ДатаОкончанияРабот,
	|	ФактическиеЗатратыЗапчастей.ДатаНачалаРабот,
	|	ФактическиеЗатратыЗапчастей.ВидЗатрат,
	|	ФактическиеЦеныЗапчастей.Цена * ФактическиеЦеныЗапчастей.Курс / ФактическиеЦеныЗапчастей.Кратность * ФактическиеЗатратыЗапчастей.Количество,
	|	3,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФактическиеЗатратыЗапчастей.ОбъектРемонта.ВнешнийОбъект, ЛОЖЬ)
	|			ТОГДА ФактическиеЗатратыЗапчастей.ОбъектРемонта.Контрагент
	|		ИНАЧЕ ЕСТЬNULL(ФактическиеЗатратыЗапчастей.ОбъектРемонта.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	NULL,
	|	НАЧАЛОПЕРИОДА(ФактическиеЗатратыЗапчастей.ДатаОкончанияРабот, МЕСЯЦ),
	|	ФактическиеЦеныЗапчастей.Цена,
	|	ФактическиеЗатратыЗапчастей.Регистратор,
	|	ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры
	|ИЗ
	|	ФактическиеЗатратыЗапчастей КАК ФактическиеЗатратыЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиеЦеныЗапчастей КАК ФактическиеЦеныЗапчастей
	|		ПО ФактическиеЗатратыЗапчастей.Номенклатура = ФактическиеЦеныЗапчастей.Номенклатура
	|			И ФактическиеЗатратыЗапчастей.Период = ФактическиеЦеныЗапчастей.ФактическийПериод
	|			И ФактическиеЗатратыЗапчастей.ЕдиницаИзмерения = ФактическиеЦеныЗапчастей.ЕдиницаИзмерения
	|			И ФактическиеЗатратыЗапчастей.ТипЦены = ФактическиеЦеныЗапчастей.ТипЦены
	|			И ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры = ФактическиеЦеныЗапчастей.ХарактеристикаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

	Возврат ЗапросТекст;
	
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
#Область Локализация

Функция дс_ДобавитьПараметрыВТекстЗапроса(ТекстЗапроса)
	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""Ремонт, выполняемый подрядчиками""", "&_РемонтВыполняемыйПодрядчиками");
	СтрокиЗамены.Вставить("""Материальные затраты""", "&_МатериальныеЗатраты");
	СтрокиЗамены.Вставить("""Трудозатраты""", "&_Трудозатраты");
	СтрокиЗамены.Вставить("""Запчасти""", "&_Запчасти");
	СтрокиЗамены.Вставить("""Установка запчастей""", "&_УстановкаЗапчастей");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
КонецФункции
 
Процедура дс_ДобавитьПараметрыВСКД()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("_РемонтВыполняемыйПодрядчиками", НСтр("es='La reparación ejecutada por contratistas';ru='Ремонт, выполняемый подрядчиками';en='Repairs performed by contractors'"));
	Переводы.Вставить("_МатериальныеЗатраты", НСтр("es='Los costos de los materiales';ru='Материальные затраты';en='Material costs'"));
	Переводы.Вставить("_Трудозатраты", НСтр("es='Mano de obra';ru='Трудозатраты';en='Labor costs'"));
	Переводы.Вставить("_Запчасти", НСтр("es='Las partes de recambio';ru='Запчасти';en='Spare parts'"));
	Переводы.Вставить("_УстановкаЗапчастей", НСтр("es='La instalación de piezas de recambio';ru='Установка запчастей';en='Installation of spare parts'"));
	
	Для каждого Перевод Из Переводы Цикл
		Если СхемаКомпоновкиДанных.Параметры.Найти(Перевод.Ключ) = Неопределено Тогда
			НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
			НовыйПараметр.Имя 			= Перевод.Ключ;
			НовыйПараметр.Значение 		= Перевод.Значение;
			НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Процедура дс_ЗаполнитьРесурсы()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("""Трудозатраты""", НСтр("es='Mano de obra';ru='Трудозатраты';en='Labor costs'"));
	Переводы.Вставить("""Запчасти""", НСтр("es='Las partes de recambio';ru='Запчасти';en='Spare parts'"));

	Поля = Новый Соответствие;
	Для каждого Поле Из СхемаКомпоновкиДанных.ПоляИтога Цикл
		Выражение = Поле.Выражение;
		
		Для каждого Перевод Из Переводы Цикл
			Выражение = СтрЗаменить(Выражение, Перевод.Ключ, """" + Перевод.Значение + """");
		КонецЦикла;

		Поле.Выражение = Выражение;
	КонецЦикла; 
КонецПроцедуры
 
#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [04.10.2019]

#КонецОбласти
